upstream/OpenFOAM-v2606/tutorials/combustion/fireFoam/LES/flameSpreadWaterSuppressionPanel/0.orig/pyrolysisRegion/qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    coupledWall_top
    {
        type            zeroGradient;
    }

    coupledWall_side
    {
        type            empty;
    }

    region0_to_pyrolysisRegion_coupledWall
    {
        type            mappedField;
        sampleRegion    region0;
        sampleMode      nearestPatchFace;
        samplePatch     region0_to_pyrolysisRegion_coupledWall;
        offset          (0 0 0);
        field       qr; // this is the name of qr field in region0
        setAverage      no;
        average         0;
        value           uniform 0;
    }
}


// ************************************************************************* //
